Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/МероприятияТрудовойДеятельности/МероприятияТрудовойДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МероприятияТрудовойДеятельности</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаМероприятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятийТрудовойДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>Сведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>РазрядКатегория</name>
    <type>
      <types>DefinedType.РазрядКатегорияДолжности</types>
    </type>
  </resources>
  <resources>
    <name>КодПоРееструДолжностей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоваяФункция</name>
    <type>
      <types>CatalogRef.ТрудовыеФункции</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДокументаОснования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОснованиеУвольнения</name>
    <type>
      <types>DefinedType.ОснованиеУвольнения</types>
    </type>
  </resources>
  <resources>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяСовместителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеДолжности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУвольненияТекстОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУвольненияСтатья</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУвольненияЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУвольненияПункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУвольненияПодПункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДолжности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдМероприятия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/РеестрКадровыхПриказов/РеестрКадровыхПриказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеестрКадровыхПриказов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Разряд</name>
    <type>
      <types>String</types>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСтавкаНадбавка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровССотрудниками</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.ПеремещениеВДругоеПодразделение</types>
      <types>DocumentRef.ВосстановлениеВДолжности</types>
      <types>DocumentRef.КадровыйПереводСписком</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.УвольнениеСписком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
      <types>DocumentRef.ПереносДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ВидыМероприятийТрудовойДеятельности/ВидыМероприятийТрудовойДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятийТрудовойДеятельности</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перевод</name>
  </enumValues>
  <enumValues>
    <name>Переименование</name>
  </enumValues>
  <enumValues>
    <name>УстановлениеВторойПрофессии</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>ЗапретЗаниматьДолжность</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/CommonModules/ЭлектронныеТрудовыеКнижкиРасширенный/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// ЗарплатаКадрыРасширеннаяПодсистемы.ИсправленияДокументов

Процедура ПриИсправленииТрудовойДеятельности(ИсправленныйДокумент) Экспорт
	
	МетаданныеДокумента = ИсправленныйДокумент.Метаданные();
	Если МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыСведений.МероприятияТрудовойДеятельности) Тогда
		
		НаборЗаписей = РегистрыСведений.МероприятияТрудовойДеятельности.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ИсправленныйДокумент);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьИсправлениеТрудовойДеятельности(Источник, Отказ) Экспорт
	
	ИсправленныйДокумент = Источник.ИсправленныйДокумент;
	
	Если ЗначениеЗаполнено(ИсправленныйДокумент) Тогда
		
		МетаданныеДокумента = ИсправленныйДокумент.Метаданные();
		Если МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыСведений.МероприятияТрудовойДеятельности) Тогда
			
			МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеДокумента.ПолноеИмя());
			МероприятияТрудовойДеятельности = МенеджерДокумента.ДанныеДляПроведенияМероприятияТрудовойДеятельности(
				ИсправленныйДокумент).Получить(ИсправленныйДокумент);
			
			НаборЗаписей = РегистрыСведений.МероприятияТрудовойДеятельности.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ИсправленныйДокумент);
			
			МенеджерДокумента.СформироватьДвиженияМероприятийТрудовойДеятельности(
				НаборЗаписей, МероприятияТрудовойДеятельности);
			
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаполненииДокументаИсправления(ДокументИсправление, ИсправляемыйДокумент) Экспорт
	
	МетаданныеДокумента = ДокументИсправление.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НомерПриказа", МетаданныеДокумента) Тогда
		РеквизитыИсправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсправляемыйДокумент, "Номер,НомерПриказа");
		ДокументИсправление.НомерПриказа = ЗарплатаКадрыОтчеты.НомерНаПечать(РеквизитыИсправления.Номер, РеквизитыИсправления.НомерПриказа);
	КонецЕсли;
	
КонецПроцедуры

// Конец ЗарплатаКадрыРасширеннаяПодсистемы.ИсправленияДокументов

Функция РазрядКатегорияВидимость() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьКвалификационнуюНадбавку")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьТарифныеСеткиПриРасчетеЗарплатыХозрасчет");
	
КонецФункции

Функция КодПоРееструДолжностейВидимость() Экспорт
	
	Возврат ПерсонифицированныйУчетРасширенный.ИспользоватьЗамещениеГосударственныхМуниципальныхДолжностей();
	
КонецФункции

Процедура УстановитьОтборПараметровПолученияСотрудниковОрганизации(ПараметрыПолучения) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		МодульГосударственнаяСлужба.УстановитьОтборПараметровПолученияСотрудниковОрганизации
			(ПараметрыПолучения);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИменаКадровыхДанныхСотрудниковДляНачалаУчета() Экспорт
	
	Возврат ЭлектронныеТрудовыеКнижкиБазовый.ИменаКадровыхДанныхСотрудниковДляНачалаУчета() + ",РазрядКатегория";
	
КонецФункции

Процедура ДополнитьМероприятияЭТКДаннымиРеестраКадровыхПриказов(ДанныеСотрудниковБезМероприятий) Экспорт
	
	Сотрудники = Новый Массив;
	Для Каждого ДанныеСотрудника Из ДанныеСотрудниковБезМероприятий Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеСотрудника.ВидМероприятия) Тогда
			Сотрудники.Добавить(ДанныеСотрудника.СотрудникЗаписи);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НаименованиеДокументаОснования", ЭлектронныеТрудовыеКнижки.НаименованиеДокументаОснования());
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ВидыДоговоров", Перечисления.ВидыДоговоровССотрудниками.ВидыДоговоровВоеннойСлужбы());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеестрКадровыхПриказов.Сотрудник КАК СотрудникЗаписи,
		|	РеестрКадровыхПриказов.ФизическоеЛицо КАК Сотрудник,
		|	РеестрКадровыхПриказов.Организация КАК Организация,
		|	РеестрКадровыхПриказов.ДокументОснование КАК ДокументОснование,
		|	РеестрКадровыхПриказов.Дата КАК ДатаМероприятия,
		|	РеестрКадровыхПриказов.ВидДоговора КАК ВидДоговора,
		|	РеестрКадровыхПриказов.ВидСобытия КАК ВидСобытия,
		|	РеестрКадровыхПриказов.ДатаПриказа КАК ДатаДокументаОснования,
		|	РеестрКадровыхПриказов.НомерПриказа КАК НомерДокументаОснования
		|ПОМЕСТИТЬ ВТРеестрКадровыхПриказов
		|ИЗ
		|	РегистрСведений.РеестрКадровыхПриказов КАК РеестрКадровыхПриказов
		|ГДЕ
		|	РеестрКадровыхПриказов.Сотрудник В(&Сотрудники)
		|	И РеестрКадровыхПриказов.Дата < ДАТАВРЕМЯ(2020, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеестрКадровыхПриказов.СотрудникЗаписи КАК СотрудникЗаписи,
		|	МАКСИМУМ(РеестрКадровыхПриказов.ДатаМероприятия) КАК ДатаМероприятия
		|ПОМЕСТИТЬ ВТПоследниеДатыМероприятий
		|ИЗ
		|	ВТРеестрКадровыхПриказов КАК РеестрКадровыхПриказов
		|
		|СГРУППИРОВАТЬ ПО
		|	РеестрКадровыхПриказов.СотрудникЗаписи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеестрКадровыхПриказов.СотрудникЗаписи КАК СотрудникЗаписи,
		|	РеестрКадровыхПриказов.ДатаМероприятия КАК ДатаМероприятия,
		|	ВЫБОР
		|		КОГДА РеестрКадровыхПриказов.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийТрудовойДеятельности.Прием)
		|		КОГДА РеестрКадровыхПриказов.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Перемещение)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийТрудовойДеятельности.Перевод)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийТрудовойДеятельности.ПустаяСсылка)
		|	КОНЕЦ КАК ВидМероприятия,
		|	&НаименованиеДокументаОснования КАК НаименованиеДокументаОснования,
		|	РеестрКадровыхПриказов.ДатаДокументаОснования КАК ДатаДокументаОснования,
		|	РеестрКадровыхПриказов.НомерДокументаОснования КАК НомерДокументаОснования
		|ИЗ
		|	ВТПоследниеДатыМероприятий КАК ПоследниеДатыМероприятий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРеестрКадровыхПриказов КАК РеестрКадровыхПриказов
		|		ПО ПоследниеДатыМероприятий.СотрудникЗаписи = РеестрКадровыхПриказов.СотрудникЗаписи
		|			И ПоследниеДатыМероприятий.ДатаМероприятия = РеестрКадровыхПриказов.ДатаМероприятия
		|ГДЕ
		|	НЕ РеестрКадровыхПриказов.ВидДоговора В (&ВидыДоговоров)";
	
	ДанныеРеестра = Запрос.Выполнить().Выгрузить();
	Для Каждого ДанныеСотрудника Из ДанныеСотрудниковБезМероприятий Цикл
		
		СтрокаРеестра = ДанныеРеестра.Найти(ДанныеСотрудника.СотрудникЗаписи, "СотрудникЗаписи");
		Если СтрокаРеестра <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ДанныеСотрудника, СтрокаРеестра);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УточнитьЗапросПолученияДанныхНаНачалоУчета(Запрос) Экспорт
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РазрядКатегория", "СотрудникиОрганизации.РазрядКатегория");
	
КонецПроцедуры

Процедура УстановитьВидимостьПолейОтраженияТрудовойДеятельностиВоеннослужащих(УправляемаяФорма) Экспорт
	
	ОтражениеТрудовойДеятельностиГруппаВидимость = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		ОтражениеТрудовойДеятельностиГруппаВидимость = МодульГосударственнаяСлужба.ОтражатьТрудовуюДеятельностьВоеннослужащих();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"ОтражениеТрудовойДеятельностиГруппа",
		"Видимость",
		ОтражениеТрудовойДеятельностиГруппаВидимость);
	
КонецПроцедуры

Функция КодДолжностиПоРееструГосударственнойСлужбы(Должность) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Возврат МодульГосударственнаяСлужба.КодДолжностиПоРееструГосударственнойСлужбы(Должность);
		
	КонецЕсли;
	
	Возврат ЭлектронныеТрудовыеКнижкиБазовый.КодДолжностиПоРееструГосударственнойСлужбы(Должность);
	
КонецФункции

Процедура ДополнитьЗапросПолучениемРазрядовКатегорийПозицийШтатногоРасписания(Запрос) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьТарифныеСеткиПриРасчетеЗарплаты")
		И ПолучитьФункциональнуюОпцию("ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании") Тогда
		
		ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписаниеПоТаблицеФильтра(
			"ВТДанныеДокументов", "ДатаМероприятия", "ДолжностьПоШтатномуРасписанию");
		
		УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
			Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПостроения, "РазрядКатегория");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДанныеДокументов.РазрядКатегория", "ШтатноеРасписание.РазрядКатегория");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТДанныеДокументов КАК ДанныеДокументов",
		"ВТДанныеДокументов КАК ДанныеДокументов
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТШтатноеРасписание КАК ШтатноеРасписание
			|ПО ДанныеДокументов.ДатаМероприятия = ШтатноеРасписание.Период
			|	И ДанныеДокументов.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.ПозицияШтатногоРасписания");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
